# -*- coding: utf-8 -*-

def first_type(word):
    sw = word[:-2]
    if sw[-1] == "к":
        print("это", sw + "ок,", "нет", sw + "ока,", "к", sw + "оку,", "вижу", sw + "ок,", "чем? -", sw + "оком,", "о", sw + "оке,", "это", sw + "оки,", "много", sw + "оков,", "к", sw + "окам,", "вижу", sw + "оки,", "чем? - ", sw + "оками,", "о", sw + "оках")
    else:
        print("это", sw + "ок,", "нет", sw + "ка,", "к", sw + "ку,", "вижу", sw + "ок,", "чем? -", sw + "ком,", "о", sw + "ке,", "это", sw + "ки,", "много", sw + "ков,", "к", sw + "кам,", "вижу", sw + "ки,", "чем? - ", sw + "ками,", "о", sw + "ках")

def second_type(word):
    sw = word[:-1]
    print("это", sw + "а,", "нет", sw + "ы,", "к", sw + "е,", "вижу", sw + "у,", "чем? -", sw + "ой,", "о", sw + "е,", "это", sw + "ы,", "много", sw + ",", "к", sw + "ам,", "вижу", sw + "у,", "чем? - ", sw + "ой,", "о", sw + "е")


word = input()
if word[-2:] == "ок":
    first_type(word)
elif word[-1] == "а":
    second_type(word)
else:
    print("неизвестное склонение")
